import React from "react";
import rektor from "../../src/img/rektor.jpg";
import univer from "../../src/img/univer.jpg";
import girl from "../../src/img/girl.jpg";
import { MdOutlineCalendarMonth } from "react-icons/md";

const news = [
  {
    image: rektor,
    text_title:
      "К.И. Скрябин атындагы КУАУнун Окумуштуулар Кеңешинин отурумунда университеттин ректору, академик Нургазиев Р.З. окуу жайдын профессор-окутуучуларына сыйлыктарды тапшырды.",
    text: "2023-жылдын 12-декабрында К.И.Скрябин атындагы Кыргыз улуттук агрардык университетинин Окумуштуулар кеңешинде Чынгыз Айтматовдун 95 жылдыгына карата өткөрүлгөн “Айтматов- улуу ойчул” аттуу кароо- сынагы жогорку деңгээлде өткөрүлгөндүгү үчүн, университеттин ректору, академик Р.З.Нургазиев ...",
  },
  {
    image: girl,
    text_title:
      "К.И. Скрябин атындагы КУАУнун Окумуштуулар Кеңешинин отурумунда университеттин ректору, академик Нургазиев Р.З. окуу жайдын профессор-окутуучуларына сыйлыктарды тапшырды.",
    text: "2023-жылдын 12-декабрында К.И.Скрябин атындагы Кыргыз улуттук агрардык университетинин Окумуштуулар кеңешинде Чынгыз Айтматовдун 95 жылдыгына карата өткөрүлгөн “Айтматов- улуу ойчул” аттуу кароо- сынагы жогорку деңгээлде өткөрүлгөндүгү үчүн, университеттин ректору, академик Р.З.Нургазиев ...",
  },
  {
    image: univer,
    text_title:
      "К.И. Скрябин атындагы КУАУнун Окумуштуулар Кеңешинин отурумунда университеттин ректору, академик Нургазиев Р.З. окуу жайдын профессор-окутуучуларына сыйлыктарды тапшырды.",
    text: "2023-жылдын 12-декабрында К.И.Скрябин атындагы Кыргыз улуттук агрардык университетинин Окумуштуулар кеңешинде Чынгыз Айтматовдун 95 жылдыгына карата өткөрүлгөн “Айтматов- улуу ойчул” аттуу кароо- сынагы жогорку деңгээлде өткөрүлгөндүгү үчүн, университеттин ректору, академик Р.З.Нургазиев ...",
  },
  {
    image: rektor,
    text_title:
      "К.И. Скрябин атындагы КУАУнун Окумуштуулар Кеңешинин отурумунда университеттин ректору, академик Нургазиев Р.З. окуу жайдын профессор-окутуучуларына сыйлыктарды тапшырды.",
    text: "2023-жылдын 12-декабрында К.И.Скрябин атындагы Кыргыз улуттук агрардык университетинин Окумуштуулар кеңешинде Чынгыз Айтматовдун 95 жылдыгына карата өткөрүлгөн “Айтматов- улуу ойчул” аттуу кароо- сынагы жогорку деңгээлде өткөрүлгөндүгү үчүн, университеттин ректору, академик Р.З.Нургазиев ...",
  },
  {
    image: girl,
    text_title:
      "К.И. Скрябин атындагы КУАУнун Окумуштуулар Кеңешинин отурумунда университеттин ректору, академик Нургазиев Р.З. окуу жайдын профессор-окутуучуларына сыйлыктарды тапшырды.",
    text: "2023-жылдын 12-декабрында К.И.Скрябин атындагы Кыргыз улуттук агрардык университетинин Окумуштуулар кеңешинде Чынгыз Айтматовдун 95 жылдыгына карата өткөрүлгөн “Айтматов- улуу ойчул” аттуу кароо- сынагы жогорку деңгээлде өткөрүлгөндүгү үчүн, университеттин ректору, академик Р.З.Нургазиев ...",
  },
  {
    image: univer,
    text_title:
      "К.И. Скрябин атындагы КУАУнун Окумуштуулар Кеңешинин отурумунда университеттин ректору, академик Нургазиев Р.З. окуу жайдын профессор-окутуучуларына сыйлыктарды тапшырды.",
    text: "2023-жылдын 12-декабрында К.И.Скрябин атындагы Кыргыз улуттук агрардык университетинин Окумуштуулар кеңешинде Чынгыз Айтматовдун 95 жылдыгына карата өткөрүлгөн “Айтматов- улуу ойчул” аттуу кароо- сынагы жогорку деңгээлде өткөрүлгөндүгү үчүн, университеттин ректору, академик Р.З.Нургазиев ...",
  },
];

const NewsPage = () => {
  return (
    <div className="news_page">
      <div className="news_title_block">
        <h3>Последние новости</h3>
        <button className="btn news_btn">Больше новостей..</button>
      </div>
      <div className="news_block_all">
        {news.map((el) => (
          <div className="news_box">
            <img src={el.image} alt="" />
            <h4>{el.text_title}</h4>
            <span>
              <MdOutlineCalendarMonth />
              12.12.2023
            </span>
            <p>{el.text}</p>
            <button className=" btn read_more_btn">Читать подробнее...</button>
          </div>
        ))}
      </div>
    </div>
  );
};

export default NewsPage;
